app/views/users/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                        <p class="text-danger">
                          <i class="fas fa-heart"></i><%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                        <p class="text-primary">
                          <i class="fas fa-heart"></i><%= book.favorites.count %>